In [1]:
import pandas as pd
import numpy as np

In [2]:
sozlukVerisi = {"Istanbul":[30,29,np.nan],"Ankara":[20,np.nan,25],"Izmir":[40,39,38]}
havaDurumuDataFrame = pd.DataFrame(sozlukVerisi)

In [3]:
havaDurumuDataFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [4]:
havaDurumuDataFrame.dropna()

   Istanbul  Ankara  Izmir
0      30.0    20.0     40

In [5]:
havaDurumuDataFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [6]:
havaDurumuDataFrame.dropna(axis=1)

   Izmir
0     40
1     39
2     38